In [2]:
import numpy as np
import pandas as pd

In [3]:
my_list=[1,2,3]
my_list

[1, 2, 3]

In [4]:
print("hello")

hello

In [5]:
np.array(my_list)

array([1, 2, 3])

In [6]:
np.eye(4)

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [7]:
labels=['a,'b','c']
        my_list=[10,20,30]
        arr=np.array([10,20,30])
        d=

SyntaxError: invalid syntax (<ipython-input-7-c89dba855311>, line 1)

In [8]:
d = dict(arr)

NameError: name 'arr' is not defined

In [9]:
import pandas as pd

In [12]:
df.iloc[['W'],['D']]

Object `df.iloc[['W'],['D']]` not found.

In [23]:
df  = pd.DataFrame(np.random.randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [24]:
df

          W         X         Y         Z
A  0.166769 -1.713295  1.319178  0.323764
B  0.008773 -0.003568 -0.666165 -0.071809
C -0.218605 -1.319178 -0.925953  0.388020
D  0.089095 -2.034179  1.514578 -0.005887
E -1.430363 -1.430243 -1.127934  0.120888

In [25]:
df.drop('E', axis = 0)

          W         X         Y         Z
A  0.166769 -1.713295  1.319178  0.323764
B  0.008773 -0.003568 -0.666165 -0.071809
C -0.218605 -1.319178 -0.925953  0.388020
D  0.089095 -2.034179  1.514578 -0.005887

In [30]:
df.loc["A"]["W"]

0.16676912710450484

In [38]:
df.iloc[0:][0:]

          W         X         Y         Z
A  0.166769 -1.713295  1.319178  0.323764
B  0.008773 -0.003568 -0.666165 -0.071809
C -0.218605 -1.319178 -0.925953  0.388020
D  0.089095 -2.034179  1.514578 -0.005887
E -1.430363 -1.430243 -1.127934  0.120888

In [39]:
df>0

       W      X      Y      Z
A   True  False   True   True
B   True  False  False  False
C  False  False  False   True
D   True  False   True  False
E  False  False  False   True

In [46]:
df2 = df[df>]

In [47]:
df2

          W   X         Y         Z
A  0.166769 NaN  1.319178  0.323764
B       NaN NaN       NaN       NaN
C       NaN NaN       NaN  0.388020
D       NaN NaN  1.514578       NaN
E       NaN NaN       NaN  0.120888

In [44]:
df.isnull().sum()

W    0
X    0
Y    0
Z    0
dtype: int64

In [45]:
df2.dropna()

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [51]:
df = pd.DataFrame({
    'A' : [1,2, np.nan],
    'B' : [5, np.nan, np.nan],
    'C': [1,2,3]
})

In [59]:
df.dropna(thresh =2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [61]:
df.fillna(value = 'new')

     A    B  C
0  1.0  5.0  1
1  2.0  new  2
2  new  new  3

In [62]:
df.fillna(value = df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [64]:
df5

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [66]:
df.describe()['A']

count    2.000000
mean     1.500000
std      0.707107
min      1.000000
25%      1.250000
50%      1.500000
75%      1.750000
max      2.000000
Name: A, dtype: float64

### MERGING, CONCATENATING AND JOINING DATAFRAMES

In [73]:
df1 = pd.DataFrame({
    'A': ['A1', 'A2', 'A3', 'A1'],
    
})

In [74]:
df1

    A
0  A1
1  A2
2  A3
3  A1

In [75]:
df1.nunique()

A    3
dtype: int64

In [76]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [77]:
del df['A']

In [79]:
df

     B  C
0  5.0  1
1  NaN  2
2  NaN  3

In [81]:
df.index

RangeIndex(start=0, stop=3, step=1)